; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=56, out_folder=htg/blocksworld//training, instance_id=36, seed=2060

(define (problem blocksworld-36)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b28)
    (on-table b28)
    (clear b53)
    (on b53 b52)
    (on b52 b11)
    (on b11 b21)
    (on b21 b35)
    (on b35 b3)
    (on b3 b43)
    (on b43 b40)
    (on b40 b45)
    (on b45 b34)
    (on b34 b30)
    (on b30 b8)
    (on b8 b39)
    (on b39 b16)
    (on-table b16)
    (clear b6)
    (on b6 b50)
    (on b50 b13)
    (on b13 b10)
    (on b10 b29)
    (on b29 b56)
    (on b56 b41)
    (on b41 b46)
    (on b46 b47)
    (on b47 b22)
    (on b22 b14)
    (on b14 b7)
    (on b7 b18)
    (on b18 b25)
    (on b25 b9)
    (on b9 b38)
    (on b38 b23)
    (on b23 b12)
    (on b12 b33)
    (on b33 b20)
    (on b20 b15)
    (on b15 b17)
    (on b17 b27)
    (on b27 b51)
    (on b51 b32)
    (on b32 b42)
    (on b42 b55)
    (on b55 b26)
    (on b26 b44)
    (on-table b44)
    (clear b49)
    (on b49 b2)
    (on-table b2)
    (clear b36)
    (on b36 b1)
    (on b1 b31)
    (on-table b31)
    (clear b5)
    (on-table b5)
    (clear b24)
    (on-table b24)
    (clear b19)
    (on b19 b54)
    (on b54 b48)
    (on b48 b37)
    (on-table b37))
 (:goal  (and 
    (clear b5)
    (on b5 b3)
    (on b3 b1)
    (on b1 b4)
    (on b4 b2)
    (on-table b2))))

; plan
1. (unstack b49 b2)
   deleted: (on b49 b2) (clear b49) (arm-empty)
   added: (holding b49) (clear b2)
   goals met: 2 of 6
2. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 2 of 6
3. (unstack b4 b28)
   deleted: (on b4 b28) (clear b4) (arm-empty)
   added: (holding b4) (clear b28)
   goals met: 2 of 6
4. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 3 of 6
5. (unstack b36 b1)
   deleted: (on b36 b1) (clear b36) (arm-empty)
   added: (holding b36) (clear b1)
   goals met: 3 of 6
6. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 3 of 6
7. (unstack b1 b31)
   deleted: (on b1 b31) (clear b1) (arm-empty)
   added: (holding b1) (clear b31)
   goals met: 3 of 6
8. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 4 of 6
9. (unstack b53 b52)
   deleted: (on b53 b52) (clear b53) (arm-empty)
   added: (holding b53) (clear b52)
   goals met: 4 of 6
10. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 4 of 6
11. (unstack b52 b11)
   deleted: (on b52 b11) (clear b52) (arm-empty)
   added: (holding b52) (clear b11)
   goals met: 4 of 6
12. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 6
13. (unstack b11 b21)
   deleted: (on b11 b21) (clear b11) (arm-empty)
   added: (holding b11) (clear b21)
   goals met: 4 of 6
14. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 6
15. (unstack b21 b35)
   deleted: (on b21 b35) (clear b21) (arm-empty)
   added: (holding b21) (clear b35)
   goals met: 4 of 6
16. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 4 of 6
17. (unstack b35 b3)
   deleted: (on b35 b3) (clear b35) (arm-empty)
   added: (holding b35) (clear b3)
   goals met: 4 of 6
18. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 6
19. (unstack b3 b43)
   deleted: (on b3 b43) (clear b3) (arm-empty)
   added: (holding b3) (clear b43)
   goals met: 4 of 6
20. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 5 of 6
21. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 6
22. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 6 of 6
